app/controllers/home_controller.rb

  def index
  	@rooms = Room.take(3)
---
SELECT  "rooms".* FROM "rooms"  LIMIT 3