app/controllers/rooms_controller.rb

  def show
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @room = current_user.rooms.find(params[:id])
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 15], ["id", 1]]

  def create
    @room = current_user.rooms.build(room_params)
      if @room.save
---
INSERT INTO "rooms" ("created_at", "description", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-03-10 04:17:17.148006"], ["description", "Big Room"], ["location", "There"], ["title", "New"], ["updated_at", "2015-03-10 04:17:17.148006"]]

  def update
    @room = current_user.rooms.find(params[:id])
    if @room.update(room_params)
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 15], ["id", 6]]
UPDATE "rooms" SET "location" = ?, "updated_at" = ? WHERE "rooms"."id" = 1  [["location", "DUndas"], ["updated_at", "2015-03-10 19:06:24.964905"]]

  def destroy
    @room = current_user.rooms.find(params[:id])
    @room.destroy
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 15], ["id", 7]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 4]]