app/controllers/users_controller.rb

INSERT INTO "users" ("bio", "confirmation_token", "created_at", "email", "full_name", "location", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  	def create
    	@user = User.new(user_params)
	    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "location" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["location", "Centro"], ["updated_at", "2015-03-10 22:13:33.090479"]]
---
	def update
	    @user = User.find(params[:id])
	    if @user.update(user_params)